#include <stdio.h>
#include <locale.h>

/*main()
{
	setlocale(LC_ALL, "RUS");
	//zd1();
	//zd2();
	//zd3();
}*/

///     ЗАДАНИЕ 3 ВАРИАНТ 7
int zd3()
{
	float L = 353; // k = 2(кол-во цифр целой части), m = 4(кол-во цифр дробной части)
	float n = 2;
	float r = n / L;
	printf("Дано:\n %f \n разделить на \n %f \n Ответ: \n %07.4f", n, L, r);
}
	

int zd1()
{
	printf("1\n\t2\n\t\t3\n");
	printf("%i\n%2i\n%3i\n%4i\n", 1, 2, 3, 4);
	printf("%10.5f\n", 12.234657);
	printf("произведение %i на %i равно %i\n", 2000, 4, 2000 * 4);
	printf("%g разделить на %e равно %f\n", 5., 2000000., 5. / 2000000.);
	printf("%d разделить на %d равно %d\n", 5., 2000000., 5. / 2000000.);
	printf("%f разделить на %f равно %f\n", 5., 2000000., 5. / 2000000.);
	printf("%g разделить на %g равно %g\n", 5., 2000000., 5. / 2000000.);
	printf("%e разделить на %e равно %e\n", 5., 2000000., 5. / 2000000.);
}
//   ЗАДАНИЕ 2
int zd2()
{
	int N, K;
	N = 20;
	K = 30;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идет %d минута суток\n", N * 60 + K);
	printf("До полуночи осталось %d часов и %d минут\n", 24 + 2 - N, 60 - K);
	printf("С 8:00 прошло %d секунд\n", ((N - 8) * 3600) + (K * 60));

	float A, S;
	A = 20;
	S = 30;
	printf("Текущий час = %.2f суток и текущая минута = %.2f часа\n\n", A / 24, S / 60);
}
